In [1]:
# Importing Pandas and Numpy libraries
import pandas as pd
import numpy as np

In [2]:
# creating Series
sales1 = pd.Series([100, 200, 300, 400], index=['Microsoft', 'Facebook', 'Amazon', 'Google'])
sales2 = pd.Series([150, 240, 410, 490], index=['Microsoft', 'Facebook', 'Amazon', 'Google'])
sales3 = pd.Series([300, 400, 500, 600], index=['Microsoft', 'Facebook', 'Amazon', 'Google'])

In [3]:
# Creating Dataframe
dataframe1 = pd.DataFrame({2017: sales1, 2018: sales2, 2019: sales3})
dataframe1

           2017  2018  2019
Microsoft   100   150   300
Facebook    200   240   400
Amazon      300   410   500
Google      400   490   600

In [4]:
# reset our index
dataframe2 = dataframe1.reset_index()
dataframe2

       index  2017  2018  2019
0  Microsoft   100   150   300
1   Facebook   200   240   400
2     Amazon   300   410   500
3     Google   400   490   600

In [5]:
# set_index() to set new index of dataframe
dataframe2.set_index(2017)

          index  2018  2019
2017
100   Microsoft   150   300
200    Facebook   240   400
300      Amazon   410   500
400      Google   490   600

In [6]:
new_index = dataframe1.reindex(index=['Microsoft', 'Google', 'T', 'F'])
new_index

            2017   2018   2019
Microsoft  100.0  150.0  300.0
Google     400.0  490.0  600.0
T            NaN    NaN    NaN
F            NaN    NaN    NaN

In [7]:
dataframe1

           2017  2018  2019
Microsoft   100   150   300
Facebook    200   240   400
Amazon      300   410   500
Google      400   490   600

In [10]:
dataframe1.loc['Facebook',2017]

200

In [11]:
v1 = new_index.reindex( columns = [2016,2015,2019])
v1

           2016  2015   2019
Microsoft   NaN   NaN  300.0
Google      NaN   NaN  600.0
T           NaN   NaN    NaN
F           NaN   NaN    NaN

In [13]:
# Hierarchical indexing.
dataframe3 = pd.DataFrame({'age': [1, 3, 5, 7], 'year': [2000, 2001, 2002, 2003], 'india':[1, 2, 3, 4],'nepal': [1.2, 2.2, 3.3, 4.2]})
dataframe3

   age  year  india  nepal
0    1  2000      1    1.2
1    3  2001      2    2.2
2    5  2002      3    3.3
3    7  2003      4    4.2

In [18]:
# making age and year as index
multi_ind = dataframe3.set_index(["year","age"])
multi_ind

          india  nepal
year age
2000 1        1    1.2
2001 3        2    2.2
2002 5        3    3.3
2003 7        4    4.2

In [19]:
type(multi_ind.index)

pandas.core.indexes.multi.MultiIndex

In [20]:
len(multi_ind.index.levels)

2

In [21]:
multi_ind.index.levels[0] # year index.

Int64Index([2000, 2001, 2002, 2003], dtype='int64', name='year')

In [22]:
multi_ind.index.levels[1] # age index.

Int64Index([1, 3, 5, 7], dtype='int64', name='age')

In [23]:
multi_ind.xs(2000)

     india  nepal
age
1        1    1.2

In [26]:
multi_ind.xs(3, level=1)

      india  nepal
year
2001      2    2.2

In [27]:
multi_ind.xs(2000, drop_level= False)

          india  nepal
year age
2000 1        1    1.2